// pages/waybillForm/waybillForm.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        waybill:['SF1627255000256','SF1627879831746','SF162725145687'],
        sendAddress:['漳州市','福州市','厦门市'],
        sendName:['张小三','王大五','大张伟'],
        state:['运输中','未签收','已签收'],
        pickAddress:['福州市','上海市','西安'],
        pickName:['白冰冰','赵晓四','张晓丽'],
        time:['2023-10-20 10:05:03','2023-10-10 13:15:13','2023-5-20 17:25:21'],
        price:['￥25','￥17','￥19']
        
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})